{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "How are you",
                "Is anyone there?",
                "Hello",
                "Good day",
                "Whats up"
            ],
            "responses": [
                "Hey :-) I'm UM Shuttle Bus Chatbot. How can I help you?",
                "Hi there, I'm UM Shuttle Bus Chatbot. What can I do for you?",
                "Hi there, I'm UM Shuttle Bus Chatbot. How can I help?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye",
                "Have a nice day"
            ],
            "responses": [
                "Bye",
                "See you later",
                "Goodbye",
                "Have a nice day",
                "Bye! Come back again soon."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "Thank's a lot!",
                "Thankiu"
            ],
            "responses": [
                "Happy to help!",
                "You are welcome!",
                "My pleasure",
                "I'm happy to help!"
            ]
        },
        {
            "tag": "name",
            "patterns": [
                "What is your name?",
                "What should I call you?",
                "Do you have a name?",
                "Name"
            ],
            "responses": [
                "You can call me UM Shuttle Bus Chatbot.",
                "I'm UM Shuttle Bus Chatbot!",
                "Just call me UM Shuttle Bus Chatbot!",
                "I'm UM Shuttle Bus Chatbot. Nice to meet you!"
            ]
        },
        {
            "tag": "route",
            "patterns": [
                "What is the bus route?",
                "Can you tell me the bus route?",
                "Can you show me the bus route?",
                "Where can I find the bus route?",
                "Bus route",
                "Bus path",
                "How many routes does the bus have?",
                "How many paths does the bus have?",
                "Can you show me the route for each bus?",
                "Where are the shuttle bus stops located?",
                "Where are the shuttle bus stops?"
            ],
            "responses": [
                "There are 6 routes (AB, BA, C, D, E and 13) for the UM shuttle bus service. Here is the UM shuttle bus service route:"
            ]
        },
        {
            "tag": "route AB",
            "patterns": [
                "Can you tell me the route for bus AB?",
                "Can you show me the route for bus AB?",
                "Where can I find the route for bus AB?",
                "Bus AB route",
                "Bus AB path",
                "Starting point for bus AB",
                "Ending point for bus AB",
                "Bus AB stops",
                "Bus AB locations",
                "Route AB",
                "Where are the shuttle bus stops for route AB?",
                "Where are the shuttle bus stops for bus AB?"
            ],
            "responses": [
                "The starting and ending points for route AB are at UM Central. Here is the route AB:",
                "The starting and ending stops for route AB are at UM Central. Here is the route AB:"
            ]
        },
        {
            "tag": "route BA",
            "patterns": [
                "Can you tell me the route for bus BA?",
                "Can you show me the route for bus BA?",
                "Where can I find the route for bus BA?",
                "Bus BA route",
                "Bus BA path",
                "Starting point for bus BA",
                "Ending point for bus BA",
                "Bus BA stops",
                "Bus BA locations",
                "Route BA",
                "Where are the shuttle bus stops for route BA?",
                "Where are the shuttle bus stops for bus BA?"
            ],
            "responses": [
                "The starting and ending points for route BA are at UM Central. Here is the route BA:" ,
                "The starting and ending stops for route BA are at UM Central. Here is the route BA:"
            ]
        },
        {
            "tag": "route C",
            "patterns": [
                "Can you tell me the route for bus C?",
                "Can you show me the route for bus C?",
                "Where can I find the route for bus C?",
                "Bus C route",
                "Bus C path",
                "Starting point for bus C",
                "Ending point for bus C",
                "Bus C stops",
                "Bus C locations",
                "Route C",
                "Where are the shuttle bus stops for route C?",
                "Where are the shuttle bus stops for bus C?"
            ],
            "responses": [
                "The starting point for route C for the first five trips is at Pantai Permai, while the starting point for trips after 09:30 is at UM Central. The ending point for route C is at UM Central. Here is route C:",
                "The starting stop for route C for the first five trips is at Pantai Permai, while the starting stop for trips after 09:30 is at UM Central. The ending stop for route C is at UM Central. Here is route C:"
            ]
        },
        {
            "tag": "route D",
            "patterns": [
                "Can you tell me the route for bus D?",
                "Can you show me the route for bus D?",
                "Where can I find the route for bus D?",
                "Bus D route",
                "Bus D path",
                "Starting point for bus D",
                "Ending point for bus D",
                "Bus D stops",
                "Bus D locations",
                "Route D",
                "Where are the shuttle bus stops for route D?",
                "Where are the shuttle bus stops for bus D?"
            ],
            "responses": [
                "The starting point for route D for the first five trips is at International House, while the starting point for trips after 09:30 is at Faculty of Engineering (Corner bus stop to PJ gate). The ending point for route D is at UM Central. Here is route D:",
                "The starting stop for route D for the first five trips is at International House, while the starting stop for trips after 09:30 is at Faculty of Engineering (Corner bus stop to PJ gate). The ending stop for route D is at UM Central. Here is route D:"
            ]
        },
        {
            "tag": "route E",
            "patterns": [
                "Can you tell me the route for bus E?",
                "Can you show me the route for bus E?",
                "Where can I find the route for bus E?",
                "Bus E route",
                "Bus E path",
                "Starting point for bus E",
                "Ending point for bus E",
                "Bus E stops",
                "Bus E locations",
                "Route E",
                "Where are the shuttle bus stops for route E?",
                "Where are the shuttle bus stops for bus E?"
            ],
            "responses": [
                "The starting and ending points for route E are at UM Central. Here is the route E:" ,
                "The starting and ending stops for route E are at UM Central. Here is the route E:"
            ]
        },
        {
            "tag": "route 13",
            "patterns": [
                "Can you tell me the route for bus 13?",
                "Can you show me the route for bus 13?",
                "Where can I find the route for bus 13?",
                "Bus 13 route",
                "Bus 13 path",
                "Starting point for bus 13",
                "Ending point for bus 13",
                "Bus 13 stops",
                "Bus 13 locations",
                "Route 13",
                "Where are the shuttle bus stops for route 13?",
                "Where are the shuttle bus stops for bus 13?"
            ],
            "responses": [
                "The starting point for route 13 for the first five trips is at 13th RESIDENTIAL COLLEGE (KK13), while the starting point for trips after 09:30 is at Faculty of Engineering (Corner bus stop to PJ gate). The ending point for route D is at UM Central. Here is route 13:",
                "The starting stop for route 13 for the first five trips is at 13th RESIDENTIAL COLLEGE (KK13), while the starting stop for trips after 09:30 is at Faculty of Engineering (Corner bus stop to PJ gate). The ending stop for route D is at UM Central. Here is route 13:"
            ]
        },
        {
            "tag": "schedule",
            "patterns": [
                "What is the bus schedule?",
                "Can you tell me the bus schedule?",
                "Can you show me the bus schedule?",
                "Where can I find the bus schedule?",
                "Bus schedule",
                "Bus timetable"
            ],
            "responses": [
                "Here is the bus schedule:"
            ]
        },
        {
            "tag": "frequency",
            "patterns": [
                "How often does the bus come?",
                "What is the frequency of the bus?",
                "Can you tell me how often the bus comes?",
                "Bus frequency",
                "Bus interval",
                "What time does shuttle buses start?",
                "What time does shuttle buses end?",
                "Operating hours for shuttle buses",
                "Shuttle buses operating hours",
                "What time does shuttle buses start operating?",
                "What time does shuttle buses stop operating?"
            ],
            "responses": [
                "UM shuttles buses operate from 7:30 AM to 10:00 PM. There are 25-26 trips per day depending on the bus route. You can check the schedule for each bus route for more information by asking \" What is the schedule for bus {route name}?\"."
            ]
        },
        {
            "tag": "schedule/frequency for bus AB",
            "patterns": [
                "What is the schedule for bus AB?",
                "Can you tell me the schedule for bus AB?",
                "Can you show me the schedule for bus AB?",
                "Where can I find the schedule for bus AB?",
                "Bus AB schedule",
                "Bus AB timetable",
                "Bus AB time",
                "How often does bus AB come?",
                "What is the frequency of bus AB?",
                "Can you tell me how often bus AB comes?",
                "Bus AB frequency",
                "What is the first bus time for bus AB?",
                "What is the last bus time for bus AB?",
                "Operating hours for bus AB",
                "Bus AB operating hours",
                "What time does bus AB start?",
                "What time does bus AB end?",
                "What is the schedule for route AB?",
                "Can you tell me the schedule for route AB?",
                "Can you show me the schedule for route AB?",
                "Where can I find the schedule for route AB?",
                "Route AB schedule",
                "Route AB timetable",
                "Route AB time"
            ],
            "responses": [
                "There are 26 trips per day for route AB. The first trip is at 7:30 AM and the last trip is at 10:00 PM. Here is the schedule for route AB:",
                "Buses for route AB operate from 7:30 AM to 10:00 PM and there are 26 trips per day. The schedule for route AB is available here:",
                "The first trip for route AB is at 7:30 AM and the last trip is at 10:00 PM. There are 26 trips per day for route AB. You can check the schedule for route AB here:"
            ]
        },
        {
            "tag": "schedule/frequency for bus BA",
            "patterns": [
                "What is the schedule for bus BA?",
                "Can you tell me the schedule for bus BA?",
                "Can you show me the schedule for bus BA?",
                "Where can I find the schedule for bus BA?",
                "Bus BA schedule",
                "Bus BA timetable",
                "Bus BA time",
                "How often does bus BA come?",
                "What is the frequency of bus BA?",
                "Can you tell me how often bus BA comes?",
                "Bus BA frequency",
                "What is the first bus time for bus BA?",
                "What is the last bus time for bus BA?",
                "Operating hours for bus BA",
                "Bus BA operating hours",
                "What time does bus BA start?",
                "What time does bus BA end?",
                "What is the schedule for route BA?",
                "Can you tell me the schedule for route BA?",
                "Can you show me the schedule for route BA?",
                "Where can I find the schedule for route BA?",
                "Route BA schedule",
                "Route BA timetable",
                "Route BA time"
            ],
            "responses": [
                "There are 26 trips per day for route BA. The first trip is at 7:30 AM and the last trip is at 10:00 PM. Here is the schedule for route BA:",
                "Buses for route BA operate from 7:30 AM to 10:00 PM and there are 26 trips per day. The schedule for route BA is available here:",
                "The first trip for route BA is at 7:30 AM and the last trip is at 10:00 PM. There are 26 trips per day for route BA. You can check the schedule for route BA here:"
            ]
        },
        {
            "tag": "schedule/frequency for bus C",
            "patterns": [
                "What is the schedule for bus C?",
                "Can you tell me the schedule for bus C?",
                "Can you show me the schedule for bus C?",
                "Where can I find the schedule for bus C?",
                "Bus C schedule",
                "Bus C timetable",
                "Bus C time",
                "How often does bus C come?",
                "What is the frequency of bus C?",
                "Can you tell me how often bus C comes?",
                "Bus C frequency",
                "What is the first bus time for bus C?",
                "What is the last bus time for bus C?",
                "Operating hours for bus C",
                "Bus C operating hours",
                "What time does bus C start?",
                "What time does bus C end?",
                "What is the schedule for route C?",
                "Can you tell me the schedule for route C?",
                "Can you show me the schedule for route C?",
                "Where can I find the schedule for route C?",
                "Route C schedule",
                "Route C timetable",
                "Route C time"
            ],
            "responses": [
                "There are 25 trips per day for route C. The first trip is at 7:30 AM and the last trip is at 10:00 PM. Here is the schedule for route C:",
                "Buses for route C operate from 7:30 AM to 10:00 PM and there are 25 trips per day. The schedule for route C is available here:",
                "The first trip for route C is at 7:30 AM and the last trip is at 10:00 PM. There are 25 trips per day for route C. You can check the schedule for route C here:"
            ]
        },
        {
            "tag": "schedule/frequency for bus D",
            "patterns": [
                "What is the schedule for bus D?",
                "Can you tell me the schedule for bus D?",
                "Can you show me the schedule for bus D?",
                "Where can I find the schedule for bus D?",
                "Bus D schedule",
                "Bus D timetable",
                "Bus D time",
                "How often does bus D come?",
                "What is the frequency of bus D?",
                "Can you tell me how often bus D comes?",
                "Bus D frequency",
                "What is the first bus time for bus D?",
                "What is the last bus time for bus D?",
                "Operating hours for bus D",
                "Bus D operating hours",
                "What time does bus D start?",
                "What time does bus D end?",
                "What is the schedule for route D?",
                "Can you tell me the schedule for route D?",
                "Can you show me the schedule for route D?",
                "Where can I find the schedule for route D?",
                "Route D schedule",
                "Route D timetable",
                "Route D time"
            ],
            "responses": [
                "There are 25 trips per day for route D. The first trip is at 7:30 AM and the last trip is at 10:00 PM. Here is the schedule for route D:",
                "Buses for route D operate from 7:30 AM to 10:00 PM and there are 25 trips per day. The schedule for route D is available here:",
                "The first trip for route D is at 7:30 AM and the last trip is at 10:00 PM. There are 25 trips per day for route D. You can check the schedule for route D here:"
            ]
        },
        {
            "tag": "schedule/frequency for bus E",
            "patterns": [
                "What is the schedule for bus E?",
                "Can you tell me the schedule for bus E?",
                "Can you show me the schedule for bus E?",
                "Where can I find the schedule for bus E?",
                "Bus E schedule",
                "Bus E timetable",
                "Bus E time",
                "How often does bus E come?",
                "What is the frequency of bus E?",
                "Can you tell me how often bus E comes?",
                "Bus E frequency",
                "What is the first bus time for bus E?",
                "What is the last bus time for bus E?",
                "Operating hours for bus E",
                "Bus E operating hours",
                "What time does bus E start?",
                "What time does bus E end?",
                "What is the schedule for route E?",
                "Can you tell me the schedule for route E?",
                "Can you show me the schedule for route E?",
                "Where can I find the schedule for route E?",
                "Route E schedule",
                "Route E timetable",
                "Route E time"
            ],
            "responses": [
                "There are 26 trips per day for route E. The first trip is at 7:30 AM and the last trip is at 10:00 PM. Here is the schedule for route E:",
                "Buses for route E operate from 7:30 AM to 10:00 PM and there are 26 trips per day. The schedule for route E is available here:",
                "The first trip for route E is at 7:30 AM and the last trip is at 10:00 PM. There are 26 trips per day for route E. You can check the schedule for route E here:"
            ]
        },
        {
            "tag": "schedule/frequency for bus 13",
            "patterns": [
                "What is the schedule for bus 13?",
                "Can you tell me the schedule for bus 13?",
                "Can you show me the schedule for bus 13?",
                "Where can I find the schedule for bus 13?",
                "Bus 13 schedule",
                "Bus 13 timetable",
                "Bus 13 time",
                "How often does bus 13 come?",
                "What is the frequency of bus 13?",
                "Can you tell me how often bus 13 comes?",
                "Bus 13 frequency",
                "What is the first bus time for bus 13?",
                "What is the last bus time for bus 13?",
                "Operating hours for bus 13",
                "Bus 13 operating hours",
                "What time does bus 13 start?",
                "What time does bus 13 end?",
                "What is the schedule for route 13?",
                "Can you tell me the schedule for route 13?",
                "Can you show me the schedule for route 13?",
                "Where can I find the schedule for route 13?",
                "Route 13 schedule",
                "Route 13 timetable",
                "Route 13 time"
            ],
            "responses": [
                "There are 25 trips per day for route 13. The first trip is at 7:30 AM and the last trip is at 10:00 PM. Here is the schedule for route 13D:",
                "Buses for route 13 operate from 7:30 AM to 10:00 PM and there are 25 trips per day. The schedule for route 13 is available here:",
                "The first trip for route 13 is at 7:30 AM and the last trip is at 10:00 PM. There are 25 trips per day for route 13. You can check the schedule for route 13 here:"
            ]
        },
        {
            "tag": "next/previous bus for route AB",
            "patterns": [
                "When is the next bus for route AB?",
                "When is the previous bus for route AB?",
                "What time is the next bus for route AB?",
                "What time is the previous bus for route AB?",
                "Next bus for route AB",
                "Previous bus for route AB",
                "Next bus AB",
                "Previous bus AB"
            ],
            "responses": [
                "The next trip for route AB is at {next bus time} and the previous trip was at {previous bus time}."
            ]
        },
        {
            "tag": "next/previous bus for route BA",
            "patterns": [
                "When is the next bus for route BA?",
                "When is the previous bus for route BA?",
                "What time is the next bus for route BA?",
                "What time is the previous bus for route BA?",
                "Next bus for route BA",
                "Previous bus for route BA",
                "Next bus BA",
                "Previous bus BA"
            ],
            "responses": [
                "The next trip for route BA is at {next bus time} and the previous trip was at {previous bus time}."
            ]
        },
        {
            "tag": "next/previous bus for route C",
            "patterns": [
                "When is the next bus for route C?",
                "When is the previous bus for route C?",
                "What time is the next bus for route C?",
                "What time is the previous bus for route C?",
                "Next bus for route C",
                "Previous bus for route C",
                "Next bus C",
                "Previous bus C"
            ],
            "responses": [
                "The next trip for route C is at {next bus time} and the previous trip was at {previous bus time}."
            ]
        },
        {
            "tag": "next/previous bus for route D",
            "patterns": [
                "When is the next bus for route D?",
                "When is the previous bus for route D?",
                "What time is the next bus for route D?",
                "What time is the previous bus for route D?",
                "Next bus for route D",
                "Previous bus for route D",
                "Next bus D",
                "Previous bus D"
            ],
            "responses": [
                "The next trip for route D is at {next bus time} and the previous trip was at {previous bus time}."
            ]
        },
        {
            "tag": "next/previous bus for route E",
            "patterns": [
                "When is the next bus for route E?",
                "When is the previous bus for route E?",
                "What time is the next bus for route E?",
                "What time is the previous bus for route E?",
                "Next bus for route E",
                "Previous bus for route E",
                "Next bus E",
                "Previous bus E"
            ],
            "responses": [
                "The next trip for route E is at {next bus time} and the previous trip was at {previous bus time}."
            ]
        },
        {
            "tag": "next/previous bus for route 13",
            "patterns": [
                "When is the next bus for route 13?",
                "When is the previous bus for route 13?",
                "What time is the next bus for route 13?",
                "What time is the previous bus for route 13?",
                "Next bus for route 13",
                "Previous bus for route 13",
                "Next bus 13",
                "Previous bus 13"
            ],
            "responses": [
                "The next trip for route 13 is at {next bus time} and the previous trip was at {previous bus time}."
            ]
        },
        {
            "tag": "operating days",
            "patterns": [
                "What days does the bus operate?",
                "Can you tell me the operating days of the bus?",
                "Bus operating days",
                "Bus days",
                "Bus operation days",
                "Does the bus operate on weekends?",
                "Does the bus operate on weekdays?",
                "Does the bus operate on public holidays?",
                "Does the bus operate on Mondays, Tuesdays, Wednesdays, Thursdays, Fridays, Saturdays, Sundays?",
                "What days does the bus not operate?",
                "Bus non-operating days",
                "Bus off days",
                "Does the bus operate during Friday Prayer?"
            ],
            "responses": [
                "The bus operates every day except during Friday prayer (12.30 PM - 2.30 PM), weekends and public holidays.",
                "The bus operates from Monday to Friday and does not operate during Friday prayer (12.30 PM - 2.30 PM), weekends and public holidays."
            ]
        },
        {
            "tag": "food and drink",
            "patterns": [
                "Are there any restrictions on food or drinks while riding the shuttle buses?",
                "Can I eat or drink on the bus?",
                "Can I bring food or drink on the bus?",
                "Food and drink on the bus",
                "Can I eat on the bus",
                "Can I drink on the bus"
            ],
            "responses": [
                "Food and drinks are not allowed on the bus."
            ]
        },
        {
            "tag": "eligibility for riding the shuttle buses",
            "patterns": [
                "Who can use the shuttle buses?",
                "Can anyone use the shuttle buses?",
                "Who is allowed to ride the shuttle buses?",
                "Eligibility for riding the shuttle buses",
                "Who can ride the shuttle buses",
                "Who can take the shuttle buses",
                "Can non-university people use the shuttle bus service?",
                "Can UM foundation students use the shuttle bus service?",
                "Can UM staff use the shuttle bus service?",
                "Can UM lecturers use the shuttle bus service?",
                "Can UM employees use the shuttle bus service?",
                "Can UM visitors use the shuttle bus service?",
                "Can UM guests use the shuttle bus service?"
            ],
            "responses": [
                "The bus permit issued by the Land Public Transport Agency of Malaysia is for the use of UM students (not including UM foundation students) and staff only."
            ]           
        },
        {
            "tag": "student card",
            "patterns": [
                "Do I need to have a UM student card to take the shuttle buses?",
                "Is a UM student card required to take the shuttle buses?",
                "Do I need to show my UM student card to take the shuttle buses?",
                "What do I need to bring to take the shuttle buses?",
                "How much does it cost to take the shuttle buses?",
                "Is there a fee for using the shuttle buses?",
                "Is there a charge for using the shuttle buses?",
                "Do I need to pay to take the shuttle buses?",
                "Do I need to pay to use the shuttle buses?",
                "Do I need to pay to ride the shuttle buses?",
                "Is the shuttle bus service free?"
            ],
            "responses": [
                "The shuttle bus service is free for UM students and staff. You need either a UM student card or an offer letter for those who have not yet obtained a UM student card."
            ]
        },
        {
            "tag": "inquiry and feedback",
            "patterns": [
                "Who should I contact if I left something on a shuttle bus?",
                "What should I do if I left something on a shuttle bus?",
                "How can I provide feedback or suggestions on the shuttle bus service?",
                "How can I make an inquiry about the shuttle bus service?",
                "Who should I contact for shuttle bus inquiries?",
                "Who should I contact for shuttle bus feedback or suggestions?"
            ],
            "responses": [
                "You can email kenderaanjpphb@um.edu.my or submit it on the UM helpdesk."
            ]
        },
        {
            "tag": "guidelines",
            "patterns": [
                "Are there any guidelines for riding the shuttle buses?",
                "Are there any specific guidelines for using the shuttle bus service?",
                "Can you tell me the guidelines for riding the shuttle buses?",
                "What are the rules for riding the shuttle buses?",
                "What are the regulations for riding the shuttle buses?"
            ],
            "responses": [
                "Guidelines for using the UM shuttle bus service:\n- Must show UM student card to the bus driver.\n- Only UM students and staff can use the shuttle bus service.\n- Must queue when boarding and alighting the bus" 
            ]
        },
        {
            "tag": "special use of shuttle buses",
            "patterns": [
                "Can I book the shuttle bus for a special event?",
                "Can I use the shuttle bus for a special event?",
                "Can I rent the shuttle bus for a special event?",
                "Can I reserve the shuttle bus for a special event?",
                "If there is an event that requires the use of the bus, how should I make reservations?"
            ],
            "responses": [
                "You can email your request to kenderaanjpphb@um.edu.my to make a reservation for the shuttle bus for a special event."
            ]
        },
        {
            "tag": "foundation students",
            "patterns": [
                "Can UM foundation students use the shuttle bus service?",
                "Are UM foundation students allowed to use the shuttle bus service?",
                "Can UM foundation students take the shuttle buses?",
                "Can UM foundation students ride the shuttle buses?"
            ],
            "responses": [
                "UM foundation students are not allowed to use the shuttle bus service, but they may be able to book a chartered bus for special events."
            ]
        },
        {
            "tag": "duration",
            "patterns": [
                "How long does the shuttle bus take to travel from one stop to another?",
                "How long does the shuttle bus take to travel from the one point to the another point?",
                "How long does the shuttle bus take from one stop to another?",
                "How long does the shuttle bus take from the one point to the another point?"
            ],
            "responses": [
                "The duration of the shuttle bus journey from one stop to another is dependent on the traffic conditions, but it usually takes around 5-10 minutes.",
                "The duration of the shuttle bus journey from one point to another is dependent on the traffic conditions, but it usually takes around 5-10 minutes."
            ]
        },
        {
            "tag": "track bus",
            "patterns": [
                "Can I track the shuttle bus?",
                "Is there a way to track the shuttle bus?",
                "How can I track the shuttle bus?",
                "Can I know the location of the shuttle bus?",
                "Can I know the current location of the shuttle bus?",
                "Can I know the real-time location of the shuttle bus?",
                "Can I know the live location of the shuttle bus?"
            ],
            "responses": [
                "Sorry, the shuttle bus service does not provide real-time tracking of the shuttle buses at the moment.",
                "Unfortunately, the shuttle bus service does not offer real-time tracking of the shuttle buses at the moment.",
                "Currently, the shuttle bus service does not provide real-time tracking of the shuttle buses."
            ]
        },
        {
            "tag": "what can I ask",
            "patterns": [
                "What can I ask you?",
                "What can I talk to you about?",
                "What can you help me with?",
                "What can you assist me with?",
                "What can you provide information on?",
                "What can you answer questions on?"
            ],
            "responses": [
                "You can ask me about the bus routes, bus schedules, bus frequencies, bus operating days, bus guidelines, bus inquiries and any other questions related to the UM shuttle bus service.",
                "I can provide information on the bus routes, bus schedules, bus frequencies, bus operating days, bus guidelines, bus inquiries and any other questions related to the UM shuttle bus service."
            ]
        }
    ]
}
